&НаКлиенте
Процедура ПрочитатьФайлыНачало()
	ПродолжитьПолучение = Новый ОписаниеОповещения("ПродолжитьПолучениеПутиКПесням", ЭтотОбъект);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Фильтр = "*.txt";
	
	НачатьПомещениеФайлов(ПродолжитьПолучение, ,ДиалогОткрытияФайла, Истина, ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТексты(Команда)
	ПрочитатьФайлыНачало();
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеПутиКПесням(СписокФайлов, Параметр) экспорт
	Если СписокФайлов = Неопределено тогда
		возврат
	КонецЕсли;
	
	Для каждого тФайл из СписокФайлов цикл
		ЗагрузитьНаСервере (тФайл.Хранение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(Знач Адрес)
	путь = КаталогВременныхФайлов()+"songs.txt";
	Файл = ПолучитьИзВременногоХранилища(Адрес);
	Файл.Записать (путь);
	фПесня = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
	
	спрПесня = Справочники.Песни.СоздатьЭлемент();
	флДошлиДоЗаголовка = ложь;
	СтрокаПесни = "";
	Пока СтрокаПесни<>Неопределено цикл
		
		СтрокаПесни = фПесня.ПрочитатьСтроку();
		Если СтрокаПесни=Неопределено тогда
			прервать;
		КонецЕсли;
		
		СтрокаПесни = СокрЛП (СтрокаПесни);
		Если СтрДлина (СтрокаПесни)=0 тогда 
			продолжить;
		КонецЕсли;
		Если не флДошлиДоЗаголовка тогда
			спрПесня.Наименование = СтрокаПесни;
			спрПесня.ТекстПесни = СтрокаПесни;
			флДошлиДоЗаголовка = Истина;
			продолжить;
		КонецЕсли;
		спрПесня.ТекстПесни = спрПесня.ТекстПесни + Символы.ПС + СтрокаПесни;
		
	КонецЦикла;
	Попытка
		спрПесня.Записать();
	Исключение
		// ЗаписьЖурналаРегистрации("Запись песни", УровеньЖурналаРегистрации.Ошибка, "Справочник.Песни", спрПесня, "При записи произошла ошибка: "+ОписаниеОшибки(), );
	КонецПопытки;
КонецПроцедуры
